Revit 2027 API
PropertySetElement.SetThermalAsset Method
 Sets a copy of the given ThermalAsset to be used in the PropertySetElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetThermalAsset(
	ThermalAsset thermalAsset
)
Public Sub SetThermalAsset (
	thermalAsset As ThermalAsset
)
public:
void SetThermalAsset(
	ThermalAsset^ thermalAsset
)
member SetThermalAsset :
        thermalAsset : ThermalAsset -> unit
Parameters
thermalAsset ThermalAsset
Exceptions
Exception | Condition
ArgumentException |  Thrown when the name of the asset is empty, contains prohibited characters, or is not unique
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PropertySetElement Class
Autodesk.Revit.DB Namespace